
# Efinity Interface Designer SDC
# Version: 2022.1.226
# Date: 2022-12-21 23:10

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: T20F256
# Project: super6502
# Timing Model: C4 (final)

# PLL Constraints
#################

create_clock -period 20.0000 clk_50
create_generated_clock -source clk_50 -multiply_by 4 i_sdrclk
create_generated_clock -source clk_50 -multiply_by 4 i_tACclk
create_generated_clock -source clk_50 -multiply_by 2 i_sysclk
create_generated_clock -source clk_50 -divide_by 25 clk_cpu


# create_clock -period 5.0000 i_sdrclk
# create_clock -period 5.0000 i_tACclk
# create_clock -period 10.0000 i_sysclk
# create_clock -period 500.0000 clk_cpu

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {button_reset}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {button_reset}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_addr[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_addr[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_rwb}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_rwb}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_sync}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_sync}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {pll_in}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {pll_in}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_phi2}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_phi2}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_irqb}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_irqb}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_nmib}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_nmib}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_rdy}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_rdy}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_resb}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_resb}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {leds[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {leds[7]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[0]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[0]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[1]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[1]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[2]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[2]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[3]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[3]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[4]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[4]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[5]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[5]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[6]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[6]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[7]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[7]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[8]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[8]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[9]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[9]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[10]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[10]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[11]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[11]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_ADDR[12]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_ADDR[12]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_BA[0]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_BA[0]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_BA[1]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_BA[1]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_CK}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_CK}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_CKE}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_CKE}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DQM[0]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DQM[0]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DQM[1]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DQM[1]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_n_CAS}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_n_CAS}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_n_CS}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_n_CS}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_n_RAS}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_n_RAS}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_n_WE}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_n_WE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_in[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_in[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_out[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_out[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_data_oe[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_data_oe[7]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[0]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[0]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[0]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[0]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[0]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[0]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[1]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[1]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[1]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[1]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[1]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[1]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[2]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[2]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[2]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[2]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[2]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[2]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[3]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[3]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[3]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[3]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[3]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[3]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[4]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[4]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[4]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[4]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[4]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[4]}]
set_input_delay -clock i_sdrclk -max 5.768 [get_ports {i_sdr_DATA[5]}]
set_input_delay -clock i_sdrclk -min 2.884 [get_ports {i_sdr_DATA[5]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[5]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[5]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[5]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[5]}]
set_input_delay -clock i_sdrclk -max 5.568 [get_ports {i_sdr_DATA[6]}]
set_input_delay -clock i_sdrclk -min 2.784 [get_ports {i_sdr_DATA[6]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[6]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[6]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[6]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[6]}]
set_input_delay -clock i_sdrclk -max 5.768 [get_ports {i_sdr_DATA[7]}]
set_input_delay -clock i_sdrclk -min 2.884 [get_ports {i_sdr_DATA[7]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[7]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[7]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[7]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[7]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[8]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[8]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[8]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[8]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[8]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[8]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[9]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[9]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[9]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[9]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[9]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[9]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[10]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[10]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[10]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[10]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[10]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[10]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[11]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[11]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[11]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[11]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[11]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[11]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[12]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[12]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[12]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[12]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[12]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[12]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[13]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[13]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[13]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[13]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[13]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[13]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[14]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[14]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[14]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[14]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[14]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[14]}]
set_input_delay -clock i_sdrclk -max 4.968 [get_ports {i_sdr_DATA[15]}]
set_input_delay -clock i_sdrclk -min 2.484 [get_ports {i_sdr_DATA[15]}]
set_output_delay -clock i_sdrclk -max -3.500 [get_ports {o_sdr_DATA[15]}]
set_output_delay -clock i_sdrclk -min -2.139 [get_ports {o_sdr_DATA[15]}]
set_output_delay -clock i_sdrclk -max -3.507 [get_ports {o_sdr_DATA_oe[15]}]
set_output_delay -clock i_sdrclk -min -2.143 [get_ports {o_sdr_DATA_oe[15]}]
